// todo Отображение времени (if...else)
/*
 * Напиши скрипт для отображения часов и минут в консоли браузера в виде строки формата "14 ч. 26 мин.". 
Если значение переменной minutes равно 0, то выводи строку "14 ч.", без минут.
 */

// const hours = 14;
// const minutes = 26;
// let timeString;

// if (minutes === 0) {
//     timeString = `${hours} ч.`;
// } else {
//     timeString = `${hours} ч. ${minutes} мин.`;
// }

// timeString = minutes === 0 ? `${hours} ч.` : `${hours} ч. ${minutes} мин.`;

// console.log(timeString);

// =================================================

// todo  Ветвления
/*
 * Напиши скрипт, который выводит в консоль строку "Это положительное число", если в prompt пользователь ввел число больше нуля. 
Если был введен ноль, выводи в консоль строку "Это ноль". 
Если передали отрицательное число, в консоли должна быть строка "Это отрицательное число".
 */

// let input = Number(prompt("Введите число:"));
// let message = "";

// console.log(input);

// if (input > 0) {
//     message = "Это положительное число";
// } else if (input === 0) {
//     message = "Это ноль";
// } else {
//     message = "Это отрицательное число";
// }

// console.log(message);
// alert(message);

// =================================================

// todo Вложенные ветвления
/*
 * Напиши скрипт, который сравнивает числа в переменных a и b. Если оба значения больше 100, то выведи в консоль максимальное из них. 
В противном случае в консоли должна быть сумма значения b и числа 512.
 */

// const a = 170;
// const b = 150;

// let message = "";

// if (a > 100 && b > 100) {
//   if (a > b) {
//     message = a;
//   } else {
//     message = b;
//   }
// } else {
//   message = b + 512;
// }

// console.log(message);

// =================================================

// todo Форматирование ссылки (endsWith)
/*
 * Напиши скрипт который проверяет заканчивается ли значение переменной link символом /. 
Если нет, добавь в конец значения link этот символ. Используй конструкцию if...else.
 */

// let link = "hello-boy";

// if (link.endsWith("/")) {
// } else {
//     link += "/";
// }

// if (!link.endsWith("/")) {
//      link += "/";
// }

// console.log(link);

// =================================================

// todo Форматирование ссылки (includes и логическое «И»)
/*
 * Напиши скрипт который проверяет заканчивается ли значение переменной link символом /. 
Если нет, добавь в конец значения link этот символ, но только в том случае, если в link есть подстрока "my-site". 
Используй конструкцию if...else.
 */

// let link = "https://somesite.com/about";
// let link = "https://somesite.com/my-site/about";

// if (!link.endsWith("/") && link.includes("my-site")) {
//   link += "/";
// }

// console.log(link);

// =================================================

// todo if...else и логические операторы
/*
 * Напиши скрипт который будет выводить в консоль браузера строку в зависимости от значения переменной hours.
 * Если значение переменной hours:
 * меньше 17, выводи строку "Pending"
 * больше либо равно 17 и меньше либо * равно 24, выводи строку "Expires"
 * больше 24 , выводи строку "Overdue"
 */

// let hours = 17;
// let message = "";

// if (hours < 17) {
//     message = "Pending";
// } else if (hours >= 17 && hours <= 24) {
//   message = "Expires";
// } else {
//   message = "Overdue";
// }

// console.log(message);

// =================================================

// todo Дедлайн сдачи проекта (if...else)
/*
 * Напиши скрипт для отображения времени дедлайна сдачи проекта. Используй конструкцию if...else.
 * Eсли до дедлайна 0 дней - выведи строку "Сегодня"
 * Eсли до дедлайна 1 день - выведи строку "Завтра"
 * Eсли до дедлайна 2 дня - выведи строку "Послезавтра"
 * Eсли до дедлайна 3+ дней - выведи строку "Дата в будущем"
 */

// const daysUntilDeadline = 5;
// Пиши код ниже этой строки

// let message = "";

// if (daysUntilDeadline === 0) {
//     message = "Сегодня";
// } else if (daysUntilDeadline === 1) {
//     message = "Завтра";
// } else if (daysUntilDeadline === 2) {
//     message = "Послезавтра";
// } else {
//     message = "Дата в будущем";
// }

// console.log(message);

// =================================================

// todo Дедлайн сдачи проекта (switch)
/*
 * Выполни рефакторинг кода задачи номер 6 используя switch.
 */

// const daysUntilDeadline = 0;
// let message = "";

// switch (daysUntilDeadline) {
//   case 0:
//     message = "Сегодня";
//     break;

//   case 1:
//     message = "Завтра";
//     break;

//   case 2:
//     message = "Послезавтра";
//     break;

//     default:
//       message = "Дата в будущем";
//     break;
// }

// console.log(message);

// =================================================

// todo Цикл for
/*
 * Напиши цикл for который выводит в консоль браузера числа по возрастанию от min до max, но только если число кратное 5.
 */

// const max = 108;
// const min = 28;

// for (let index = min; index <= max; index+=1) {
//     if (index % 5 === 0) {
//         console.log(index);
//     }
// }

// =================================================

// todo  Ввод пользователя и ветвления
/*
 * Напиши скрипт, который будет спрашивать логин с помощью prompt и логировать результат в консоль браузера.
 * Если посетитель вводит "Админ", то prompt запрашивает пароль
 * Если ничего не введено или нажата клавиша Esc - вывести строку "Отменено"
 * В противном случае вывести строку "Я вас не знаю"
 * Пароль проверять так:
 * Если введён пароль "Я админ", то вывести строку "Здравствуйте!"
 * Иначе выводить строку "Неверный пароль"
 */

let input = prompt("Введите логин:");
console.log(input);

if (input === "Админ") {
  let password = prompt("Введите пароль:");
  if (password === "Я админ") {
    alert("Здравствуйте");
    console.log("Здравствуйте");
  } else {
    alert("Не верный пароль");
    console.log("Не верный пароль");
  }
} else if (input === null || input === "") {
  alert("Отменено");
  console.log("Отменено");
} else {
  alert("Я вас не знаю");
  console.log("Я вас не знаю");
}
